Configuration/InformationRegisters/ВерификацияРеквизитовРаспознанныхДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ВерификацияРеквизитовРаспознанныхДокументов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Проверен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТребуетПроверки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаПроверки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РаспознанноеЗначение</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.РаспознаваемыеРеквизитыДокумента</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УстановленноеЗначение</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.РаспознаваемыеРеквизитыДокумента</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДокументыПредприятия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИмяРеквизита</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Configuration/InformationRegisters/ВерификацияРеквизитовРаспознанныхДокументов/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область СлужебныйПрограммныйИнтерфейс

// Добавляет запись в регистр
// 
// Параметры:
//  ДокументСсылка - СправочникСсылка.ДокументыПредприятия
//  ИмяРеквизита - Строка
//  ПараметрыПроверки - Структура
Процедура ДобавитьПроверяемыйРеквизит(ДокументСсылка, ИмяРеквизита, ПараметрыПроверки) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запись = СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(Запись, ПараметрыПроверки);
	Запись.Документ = ДокументСсылка;
	Запись.ИмяРеквизита = ИмяРеквизита;

	Запись.Записать(Истина);	
	
КонецПроцедуры

// Устанавливает статус проверки
// 
// Параметры:
//  ДокументСсылка - СправочникСсылка.ДокументыПредприятия
//  ИмяРеквизита - Строка
//  ПараметрыПроверки - Структура
Процедура УстановитьСтатусПроверкиРеквизита(ДокументСсылка, ИмяРеквизита, ПараметрыПроверки) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	НачатьТранзакцию();
	
  	Попытка
  		
  		Блокировка = Новый БлокировкаДанных;
  		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ВерификацияРеквизитовРаспознанныхДокументов");
  		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
  		ЭлементБлокировки.УстановитьЗначение("Документ", ДокументСсылка);
  		Блокировка.Заблокировать();
  		
		НаборЗаписей = СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Документ.Установить(ДокументСсылка);
		НаборЗаписей.Отбор.ИмяРеквизита.Установить(ИмяРеквизита);
		НаборЗаписей.Прочитать();
		ЗаполнитьЗначенияСвойств(НаборЗаписей[0], ПараметрыПроверки);
		НаборЗаписей[0].Ответственный = Пользователи.ТекущийПользователь();
		НаборЗаписей[0].ДатаПроверки = ТекущаяДатаСеанса();
		
		НаборЗаписей.Записать();
		
		ЗафиксироватьТранзакцию();
		
	Исключение
  		
  		ОтменитьТранзакцию();
  		ВызватьИсключение;
  		
  	КонецПопытки;
  	
КонецПроцедуры

// Требует проверки.
// 
// Параметры:
//  ДокументСсылка - СправочникСсылка.ДокументыПредприятия
// 
// Возвращаемое значение:
//  Булево - Требует проверки
Функция НеобходимаПроверкаРеквизитов(ДокументСсылка) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);

	Запрос = Новый Запрос("
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ Первые 1
		|	ВерификацияРеквизитовРаспознанныхДокументов.Документ
		|ИЗ
		|	РегистрСведений.ВерификацияРеквизитовРаспознанныхДокументов КАК ВерификацияРеквизитовРаспознанныхДокументов
		|ГДЕ
		|	ВерификацияРеквизитовРаспознанныхДокументов.Документ = &Документ
		|	И ВерификацияРеквизитовРаспознанныхДокументов.ТребуетПроверки = ИСТИНА 
		|		И ВерификацияРеквизитовРаспознанныхДокументов.Проверен = ЛОЖЬ");
	
	Запрос.УстановитьПараметр("Документ", ДокументСсылка);
	Возврат Не Запрос.Выполнить().Пустой();
	
КонецФункции

// Реквизиты требующие проверки.
// 
// Параметры:
//  ДокументСсылка - СправочникСсылка.ДокументыПредприятия
//  ВключаяПроверенные - Булево
// 
// Возвращаемое значение:
//  ТаблицаЗначений
Функция РеквизитыТребующиеПроверки(ДокументСсылка, ВключаяПроверенные = Ложь) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);

	Запрос = Новый Запрос("
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВерификацияРеквизитовРаспознанныхДокументов.ИмяРеквизита КАК ИмяРеквизита,
		|	ВерификацияРеквизитовРаспознанныхДокументов.Проверен КАК Проверен,
		|	ВерификацияРеквизитовРаспознанныхДокументов.РаспознанноеЗначение КАК РаспознанноеЗначение
		|ИЗ
		|	РегистрСведений.ВерификацияРеквизитовРаспознанныхДокументов КАК ВерификацияРеквизитовРаспознанныхДокументов
		|ГДЕ
		|	ВерификацияРеквизитовРаспознанныхДокументов.Документ = &Документ
		|	И ВерификацияРеквизитовРаспознанныхДокументов.ТребуетПроверки = ИСТИНА
		|		И ВерификацияРеквизитовРаспознанныхДокументов.Проверен = ЛОЖЬ");
	
	Если ВключаяПроверенные Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"И ВерификацияРеквизитовРаспознанныхДокументов.Проверен = ЛОЖЬ", "");
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Документ", ДокументСсылка);
	
	ТаблицаРеквизитов = Запрос.Выполнить().Выгрузить();
	Возврат ТаблицаРеквизитов;
	
КонецФункции

// Реквизиты требующие проверки.
// 
// Параметры:
//  ДокументСсылка - СправочникСсылка.ДокументыПредприятия
//  ИмяРеквизита - Строка
// 
// Возвращаемое значение: 
//  Булево
Функция НеобходимаПроверкаРеквизита(ДокументСсылка, ИмяРеквизита) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);

	Запрос = Новый Запрос("
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВерификацияРеквизитовРаспознанныхДокументов.ИмяРеквизита 
		|ИЗ
		|	РегистрСведений.ВерификацияРеквизитовРаспознанныхДокументов КАК ВерификацияРеквизитовРаспознанныхДокументов
		|ГДЕ
		|	ВерификацияРеквизитовРаспознанныхДокументов.ИмяРеквизита = &ИмяРеквизита
		|	И ВерификацияРеквизитовРаспознанныхДокументов.Документ = &Документ
		|	И ВерификацияРеквизитовРаспознанныхДокументов.ТребуетПроверки = ИСТИНА
		|		И ВерификацияРеквизитовРаспознанныхДокументов.Проверен = ЛОЖЬ");
	
	Запрос.УстановитьПараметр("Документ", ДокументСсылка);
	Запрос.УстановитьПараметр("ИмяРеквизита", ИмяРеквизита);
	
	Возврат Не Запрос.Выполнить().Пустой();
	
КонецФункции

// Удалить данные документа.
// 
// Параметры:
//  ДокументСсылка - СправочникСсылка.ДокументыПредприятия
Процедура УдалитьДанныеДокумента(ДокументСсылка) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	НаборЗаписей = СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Документ.Установить(ДокументСсылка);
	НаборЗаписей.Записать();
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
